app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."account" = ? LIMIT 1  [["account", "ad"]]
---
	def create

			params[:captcha] = params[:session][:captcha];
			params[:captcha_key] = params[:session][:captcha_key];

			if simple_captcha_valid?
				loginlog = Loginlog.new
				curtime = Time.new
				loginlog.time = curtime.strftime("%Y-%m-%d %H:%M:%S")

				useraccount = params[:session][:account]
				userpassword = params[:session][:password]
				@user = User.find_by_account(useraccount)