app/controllers/users_controller.rb

	def create
		@user = User.new(params.require(:user).permit(:account, :password, :nickname, :coin))

		if @user.save
---
INSERT INTO "users" ("account", "password", "nickname", "coin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["account", "test"], ["password", "123"], ["nickname", "nick"], ["coin", 100], ["created_at", "2015-06-16 06:57:44.686370"], ["updated_at", "2015-06-16 06:57:44.686370"]]